<?php

// +----------------------------------------------------------------------
// | ThinkAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2019 
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 

// +----------------------------------------------------------------------

// 获取请求的URI
$uri = urldecode(parse_url($_SERVER['REQUEST_URI'], PHP_URL_PATH));

// 如果请求的是 .html 结尾的URL，去掉 .html 后缀
if (preg_match('/\.html$/', $uri)) {
    $uri = preg_replace('/\.html$/', '', $uri);
}

// 如果请求的是根目录，重定向到 index/index/home
if ($uri === '/') {
    header('Location: /index/index/home');
    exit;
}

// 如果文件不存在，则转发到 index.php
if (!file_exists(__DIR__ . $uri)) {
    $_SERVER['REQUEST_URI'] = $uri;
    require __DIR__ . '/index.php';
} else {
    return false; // 让服务器处理静态文件
}
