<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 核心中文语言包
return [
    // 系统错误提示
    'Language'=>'语言切换',
    'Len' =>'英语', 
    'Lzh'=>'中文',
    'Lfr'=>'法语',
    'Les'=>'西班牙语',
    'Lpt'=>'葡萄牙语',
    'Lind'=>'印度语',
    'Lth'=>'泰语',
    'Lkr'=>'韩语',
    'Ljp'=>'日语',
    'PasswordLogin'=>'密码登录',
    'Home'=>'返回首页',
    '返回'=>'返回',
    '充值.提现'=>'充值.提现',
];
